<center>
<img src="https://raw.githubusercontent.com/PinkWink/DataScience/master/img/title.jpg" width="200" height="200"><br>
</center>

# 1장 - 서울시 구별 CCTV 현황 분석



## 1-1 CCTV 현황과 인구 현황 데이터 구하기


서울시의 CCTV 현황은 구글 검색만으로도 쉽게 구할 수 있다. '서울시 자치구 연도별 CCTV 설치 현황'을 검색하면 '서울 열린데이터 광장' 사이트의 해당 페이지로 갈 수 있다. csv 파일은 콤마로 구분된 파일이다. 우리나라에서는 잘 통용되지 않지만 외국 자료를 검색하다 보면 자주 나타난다. 텍스트 파일이기 때문에 메모장에서도 열린다. 그런데 만약 csv 파일에 한글이 UTF-8로 인코딩되어 있다면 엑셀에서 열었을때 한글이 깨져 보일 수 있다.
나는 위 책의 나와있는 github에서 data를 다운 받았다.(데이터 출처: https://github.com/PinkWink/DataScience)



## 1-2  파이썬에서 텍스트 파일과 엑셀 파일 읽기 - pandas


앞서 얻은 파일을 읽어와야 한다. 파이썬에서는 이런 종류의 파일을 아주 손쉽게 읽을 수 있는 모듈이 있다. 바로 pandas 이다.

In [3]:
import pandas as pd

ModuleNotFoundError: No module named 'pandas'

In [5]:
!pip3 install pandas

Collecting pandas
  Downloading https://files.pythonhosted.org/packages/c3/e2/00cacecafbab071c787019f00ad84ca3185952f6bb9bca9550ed83870d4d/pandas-1.1.5-cp36-cp36m-manylinux1_x86_64.whl (9.5MB)
    100% |████████████████████████████████| 9.5MB 70kB/s eta 0:00:011
Collecting numpy>=1.15.4 (from pandas)
  Downloading https://files.pythonhosted.org/packages/45/b2/6c7545bb7a38754d63048c7696804a0d947328125d81bf12beaa692c3ae3/numpy-1.19.5-cp36-cp36m-manylinux1_x86_64.whl (13.4MB)
    100% |████████████████████████████████| 13.4MB 51kB/s eta 0:00:01
Collecting python-dateutil>=2.7.3 (from pandas)
  Using cached https://files.pythonhosted.org/packages/d4/70/d60450c3dd48ef87586924207ae8907090de0b306af2bce5d134d78615cb/python_dateutil-2.8.1-py2.py3-none-any.whl
Collecting pytz>=2017.2 (from pandas)
  Downloading https://files.pythonhosted.org/packages/70/94/784178ca5dd892a98f113cdd923372024dc04b8d40abe77ca76b5fb90ca6/pytz-2021.1-py2.py3-none-any.whl (510kB)
    100% |████████████████████████████████| 512kB 605kB/s ta 0:00:011
Collecting six>=1.5 (from python-dateutil>=2.7.3->pandas)
  Using cached https://files.pythonhosted.org/packages/ee/ff/48bde5c0f013094d729fe4b0316ba2a24774b3ff1c52d924a8a4cb04078a/six-1.15.0-py2.py3-none-any.whl
Installing collected packages: numpy, six, python-dateutil, pytz, pandas
Successfully installed numpy-1.19.5 pandas-1.1.5 python-dateutil-2.8.1 pytz-2021.1 six-1.15.0

앞으로도 위 코드와 같이 대부분의 시작은 import로 하게 될 것이다. 파이썬에서 원하는 모듈을 불러오는 명령이 import 이다. 모듈명 다음의 as는 as 뒤에 붙는 pd라는 짧은 단어로 pandas를 대체한다는 뜻이다.
pandas에서 csv파일을 읽는 명령은 read_csv 이다. 그 안에 한글을 사용하는 경우는 인코딩에 신경 써야 한다. 우리가 받은 cctv 데이터는 UTF-8로 인코딩 되어 있어서 read_csv 명령을 쓸 때 encoding 옵션에 UTF-8 이라고 지정한다.

In [4]:
CCTV_Seoul = pd.read_csv('C:/Users/이재윤/DataScience/data/01. CCTV_in_Seoul.csv', encoding='utf-8')
CCTV_Seoul.head()

NameError: name 'pd' is not defined

pandas 데이터는 제일 첫 줄에 보이는 것이 해당하는 열(column)을 대표하는 일종의 제목이다. 그래서 첫 줄을 column 이라고 한다. 데이터 뒤에 columns 라고 하면 column의 이름들이 반환된다.

In [2]:
CCTV_Seoul.columns

NameError: name 'CCTV_Seoul' is not defined

In [40]:
CCTV_Seoul.columns[0]

'기관명'

기관명이라고 되어 있어 이를 '구별' 이라는 이름으로 하자. 이렇게 이름을 바꾸는 명령은 rename 이라고 한다.

In [41]:
CCTV_Seoul.rename(columns={CCTV_Seoul.columns[0] : '구별'}, inplace=True)
CCTV_Seoul.head()

    구별    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  2780       1292    430    584    932
1  강동구   773        379     99    155    377
2  강북구   748        369    120    138    204
3  강서구   884        388    258    184     81
4  관악구  1496        846    260    390    613

이번엔 두 번째 받은 엑셀 파일을 읽어야 한다. 그 명령은 read_excel이다. 그냥 인코딩만 지정하고 읽었더니 약간 이상하다. 그것은 원본 엑셀 파일이 아래에서 보이는 것처럼 첫 세 줄이 열의 제목처럼 되어 있기 때문이다.

In [47]:
pop_Seoul = pd.read_excel('C:/Users/이재윤/DataScience/data/01. population_in_Seoul.xls')
pop_Seoul.head()

,기간,자치구,세대,인구,인구.1,인구.2,인구.3,인구.4,인구.5,인구.6,인구.7,인구.8,세대당인구,65세이상고령자
0,기간,자치구,세대,합계,합계,합계,한국인,한국인,한국인,등록외국인,등록외국인,등록외국인,세대당인구,65세이상고령자
1,기간,자치구,세대,계,남자,여자,계,남자,여자,계,남자,여자,세대당인구,65세이상고령자
2,2017.1/4,합계,4202888,10197604,5000005,5197599,9926968,4871560,5055408,270636,128445,142191,2.36,1321458
3,2017.1/4,종로구,72654,162820,79675,83145,153589,75611,77978,9231,4064,5167,2.11,25425
4,2017.1/4,중구,59481,133240,65790,67450,124312,61656,62656,8928,4134,4794,2.09,20764

그리고 엑셀파일을 읽을 때는 옵션을 좀 더 많이 적용해 보자. 일단 엑셀을 읽는 read_excel 명령 안에서 세 번째 줄부터 읽으라는 header=2 라는 옵션을 걸고, B,D,G,J,N 열만 읽도록 usecols='B,D,G,J,N' 이라는 옵션을 넣었다.

In [54]:
pop_Seoul = pd.read_excel('C:/Users/이재윤/DataScience/data/01. population_in_Seoul.xls',header =2,
                         usecols = 'B,D,G,J,N',
                         )
pop_Seoul.head()

   자치구           계        계.1       계.2   65세이상고령자
0   합계  10197604.0  9926968.0  270636.0  1321458.0
1  종로구    162820.0   153589.0    9231.0    25425.0
2   중구    133240.0   124312.0    8928.0    20764.0
3  용산구    244203.0   229456.0   14747.0    36231.0
4  성동구    311244.0   303380.0    7864.0    39997.0

출력된 모습도 간결하게 되었다. 하지만 컬럼의 이름에 문제가 있는거 같아 rename 명령을 사용해서 컬럼의 이름을 변경한다.

In [57]:
pop_Seoul.rename(columns={pop_Seoul.columns[0] : '구별',
                         pop_Seoul.columns[1] : '인구수',
                         pop_Seoul.columns[2] : '한국인',
                         pop_Seoul.columns[3] : '외국인',
                         pop_Seoul.columns[4] : '고령자'}, inplace=True)
pop_Seoul.head()

    구별         인구수        한국인       외국인        고령자
0   합계  10197604.0  9926968.0  270636.0  1321458.0
1  종로구    162820.0   153589.0    9231.0    25425.0
2   중구    133240.0   124312.0    8928.0    20764.0
3  용산구    244203.0   229456.0   14747.0    36231.0
4  성동구    311244.0   303380.0    7864.0    39997.0

이제 어느정도 정돈된 모습이다. CCTV_Seoul 이라는 변수에는 '구별 CCTV 현황'을 pop_Seoul 이라는 변수에는 '구별 인구 현황'을 저장했다.
pandas 에서 몇줄 입력하지 않았는데 우리는 두 종류의 파일을 보기 좋게 읽었다.


## 1-3 pandas 기초 익히기


이 절의 튜토리얼에서는 pandas의 기초 튜토리얼을 익히고 지나가자.

In [58]:
import pandas as pd
import numpy as np

pandas 와 numpy 를 import 했다. 이 두 모듈은 자주 사용하는 모듈이면서 함께 쓰면 유용하다.

In [59]:
s= pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

pandas의 데이터 유형 중 기초가 되는 것이 Series 이다. 대괄호로 만드는 파이썬의 list데이터로 만들 수 있다.

In [61]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

또 pandas 에는 날짜형의 데이터인 date_range가 있다. 기본 날짜를 지정하고 periods 옵션으로 6일간이라고 지정한다.

In [72]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=['A','B','C','D'])

df

                   A         B         C         D
2013-01-01 -0.673948 -0.025956  0.872478  0.598716
2013-01-02  0.060423  0.220752  0.638659 -0.519815
2013-01-03 -0.817083 -0.479581 -0.560688  1.953939
2013-01-04 -0.518583 -1.161599 -0.249712  0.134959
2013-01-05 -0.317395 -0.103955 -0.643168  0.705956
2013-01-06  0.869004  0.798328 -1.194615  0.674388

이제 DataFrame 유형의 데이터를 만든다. 6행 4열의 random 변수를 만들고, 컬럼에서 위와같이 A,B,C,D 로 지정하고 index 명령으로 전 단계에서 만든 날짜형 데이터인 dates를 index=dates 옵션을 이용해서 지정했다.

In [63]:
df.head(3)

                   A         B         C         D
2013-01-01  0.502528 -0.625320  2.738426  3.407983
2013-01-02 -0.835681  1.247111 -0.823651 -0.925350
2013-01-03  1.613887  0.091394 -0.918725  1.232192

head() 명령을 사용하면 기본적으로 첫 5행을 보여준다. 괄호 안에 숫자를 넣으면 그 숫자만큼의 행을 볼 수 있다.

In [64]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [66]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

그리고 index, columns 명령을 이용하면 pandas의 DataFrame의 컬럼과 인덱스를 확인할 수 있다.

In [68]:
df.values

array([[ 0.50252805, -0.62532012,  2.73842555,  3.40798333],
       [-0.83568056,  1.24711079, -0.8236512 , -0.92534958],
       [ 1.61388716,  0.09139403, -0.9187248 ,  1.23219169],
       [-1.26781204,  1.39755694,  1.41088327,  1.63749298],
       [-0.25813756,  0.44743952, -0.35672043, -1.68391409],
       [ 1.49228602,  0.09300786,  1.15112397,  0.48572557]])

그리고 그 안에 들어가는 내용은 values 명령으로 확인할 수 있다. 그리고 info() 명령을 사용하면 DataFrame의 개요를 알 수 있다.

In [69]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2013-01-01 to 2013-01-06
Freq: D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       6 non-null      float64
 1   B       6 non-null      float64
 2   C       6 non-null      float64
 3   D       6 non-null      float64
dtypes: float64(4)
memory usage: 240.0 bytes

describe() 명령을 사용하면 통계적 개요를 확인할 수 있다. 아래처럼 평균과 개수, min, max, 표준편차까지 알 수 있다.

In [70]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.207845  0.441865  0.533556  0.692355
std    1.199769  0.767491  1.466715  1.836609
min   -1.267812 -0.625320 -0.918725 -1.683914
25%   -0.691295  0.091797 -0.706919 -0.572581
50%    0.122195  0.270224  0.397202  0.858959
75%    1.244847  1.047193  1.345943  1.536168
max    1.613887  1.397557  2.738426  3.407983

이때 values가 숫자가 아니라 문자라고 하더라도 그에 맞는 개요가 나타난다.

In [73]:
df.sort_values(by='B', ascending=False)

                   A         B         C         D
2013-01-06  0.869004  0.798328 -1.194615  0.674388
2013-01-02  0.060423  0.220752  0.638659 -0.519815
2013-01-01 -0.673948 -0.025956  0.872478  0.598716
2013-01-05 -0.317395 -0.103955 -0.643168  0.705956
2013-01-03 -0.817083 -0.479581 -0.560688  1.953939
2013-01-04 -0.518583 -1.161599 -0.249712  0.134959

sort_values 명령은 by로 지정된 컬럼을 기준으로 정렬한다. ascending 옵션을 사용하면 내림차순이나 오름차순으로 정렬시킬 수 있다.

In [74]:
df

                   A         B         C         D
2013-01-01 -0.673948 -0.025956  0.872478  0.598716
2013-01-02  0.060423  0.220752  0.638659 -0.519815
2013-01-03 -0.817083 -0.479581 -0.560688  1.953939
2013-01-04 -0.518583 -1.161599 -0.249712  0.134959
2013-01-05 -0.317395 -0.103955 -0.643168  0.705956
2013-01-06  0.869004  0.798328 -1.194615  0.674388

그냥 변수명을 적고 실행 하면 그 내용이 나타난다. 너무 많으면 jupyter notebook 에서 내용을 줄인다.

In [76]:
df['A']

2013-01-01   -0.673948
2013-01-02    0.060423
2013-01-03   -0.817083
2013-01-04   -0.518583
2013-01-05   -0.317395
2013-01-06    0.869004
Freq: D, Name: A, dtype: float64

DataFrame으로 선언된 변수의 경우 변수명 뒤에 ['A']와 같이 붙여주면 해당 컬럼만 Series로 보여준다. 중간부터 보고싶다면 df[0:3]이라고 하면 된다.

In [77]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.673948 -0.025956  0.872478  0.598716
2013-01-02  0.060423  0.220752  0.638659 -0.519815
2013-01-03 -0.817083 -0.479581 -0.560688  1.953939

만약 2013.01.02 부터 2013.01.04 까지의 행을 보고 싶다면 아래과 같이 하면 된다.

In [79]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  0.060423  0.220752  0.638659 -0.519815
2013-01-03 -0.817083 -0.479581 -0.560688  1.953939
2013-01-04 -0.518583 -1.161599 -0.249712  0.134959

앞에서 만든 dates 변수를 이용해 특정 날짜의 데이터만 보고 싶으면 df.loc 명령을 사용하면 된다. loc는 location 옵션으로 슬라이싱 할 때 loc 옵션을 이용해서 위치 값을 지정할 수 있다.

In [81]:
df.loc[dates[0]]

A   -0.673948
B   -0.025956
C    0.872478
D    0.598716
Name: 2013-01-01 00:00:00, dtype: float64

A,B 열의 모든 행을 보고싶으면 df.loc['A','B']라고 하면 된다.

In [84]:
df.loc[:,['A','B']]

                   A         B
2013-01-01 -0.673948 -0.025956
2013-01-02  0.060423  0.220752
2013-01-03 -0.817083 -0.479581
2013-01-04 -0.518583 -1.161599
2013-01-05 -0.317395 -0.103955
2013-01-06  0.869004  0.798328

물론 행과 열의 범위를 모두 지정할 수 있다.

In [86]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02  0.060423  0.220752
2013-01-03 -0.817083 -0.479581
2013-01-04 -0.518583 -1.161599

In [87]:
df.loc['20130102',['A','B']]

A    0.060423
B    0.220752
Name: 2013-01-02 00:00:00, dtype: float64

In [89]:
df.loc[dates[0],'A']

-0.6739475466739037

하지만 loc 명령과 달리 행과 열의 번호를 이용해서 데이터에 바로 접근할 때 쓰는 명령어가 iloc 입니다. iloc을 사용하면 행이나 열의 범위를 지정하면 된다. 특히 콜론(:)을 사용하면 전체를 의미한다.

In [90]:
df.iloc[3]

A   -0.518583
B   -1.161599
C   -0.249712
D    0.134959
Name: 2013-01-04 00:00:00, dtype: float64

먼저 iloc에 단지 숫자만 표시하면 3번행(0번부터시작) 즉 4번째 행이 나온다.

In [91]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04 -0.518583 -1.161599
2013-01-05 -0.317395 -0.103955

또 위처럼 3번째부터 5번째 앞, 즉 3번째부터 4번째까지 행과 0번부터 1번까지 열의 데이터만 가져올 수 있다.

In [92]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  0.060423  0.638659
2013-01-03 -0.817083 -0.560688
2013-01-05 -0.317395 -0.643168

또 범위가 아니라 콤마로 행이나 열을 지정해서 데이터를 위처럼 가져올 수 있다. 행이나 열에 대해 한쪽은 전체를 의미하게 하고 싶을때는 그냥 콜론만 사용하면 된다.

In [93]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02  0.060423  0.220752  0.638659 -0.519815
2013-01-03 -0.817083 -0.479581 -0.560688  1.953939

In [94]:
df.iloc[:,1:3]

                   B         C
2013-01-01 -0.025956  0.872478
2013-01-02  0.220752  0.638659
2013-01-03 -0.479581 -0.560688
2013-01-04 -1.161599 -0.249712
2013-01-05 -0.103955 -0.643168
2013-01-06  0.798328 -1.194615

반대로 행을 전체로 선택했다. 다시 df를 호출하자.

In [96]:
df

                   A         B         C         D
2013-01-01 -0.673948 -0.025956  0.872478  0.598716
2013-01-02  0.060423  0.220752  0.638659 -0.519815
2013-01-03 -0.817083 -0.479581 -0.560688  1.953939
2013-01-04 -0.518583 -1.161599 -0.249712  0.134959
2013-01-05 -0.317395 -0.103955 -0.643168  0.705956
2013-01-06  0.869004  0.798328 -1.194615  0.674388

DataFrame에서 특정 조건을 만족하는 데이터만 얻을 수 있다. 컬럼을 지정할 때 df['A']처럼 할 수도 있고, df.A와 같이 할 수도 있다. 컬럼 A에서 0보다 큰 행만 얻는 것이다.

In [97]:
df[df.A>0]

                   A         B         C         D
2013-01-02  0.060423  0.220752  0.638659 -0.519815
2013-01-06  0.869004  0.798328 -1.194615  0.674388

데이터 전체에서 조건을 걸면 만족하지 않은 곳은 NaN 처리가 된다.

In [98]:
df[df>0]

                   A         B         C         D
2013-01-01       NaN       NaN  0.872478  0.598716
2013-01-02  0.060423  0.220752  0.638659       NaN
2013-01-03       NaN       NaN       NaN  1.953939
2013-01-04       NaN       NaN       NaN  0.134959
2013-01-05       NaN       NaN       NaN  0.705956
2013-01-06  0.869004  0.798328       NaN  0.674388

DataFrame을 복사할 때는 그냥 = 기호를 이용해서 복사하면 실제 데이터의 내용이 복사되는 것이 아니라 데이터 위치만 복사되기 때문에 원본 데이터는 하나만 있게된다. 데이터 내용까지 복사하라는 지령은 copy() 옵션을 붙이면 된다.

In [104]:
df2 = df.copy()

In [106]:
df2['E'] = ['one','one','two','three','four','three']
df2

                   A         B         C         D      E
2013-01-01 -0.673948 -0.025956  0.872478  0.598716    one
2013-01-02  0.060423  0.220752  0.638659 -0.519815    one
2013-01-03 -0.817083 -0.479581 -0.560688  1.953939    two
2013-01-04 -0.518583 -1.161599 -0.249712  0.134959  three
2013-01-05 -0.317395 -0.103955 -0.643168  0.705956   four
2013-01-06  0.869004  0.798328 -1.194615  0.674388  three

원래 있는 DataFrame 에서 새로운 컬럼을 추가하는 것은 위처럼 하면 된다.

In [110]:
df2['E'].isin(['two','four'])

2013-01-01    False
2013-01-02    False
2013-01-03     True
2013-01-04    False
2013-01-05     True
2013-01-06    False
Freq: D, Name: E, dtype: bool

위에서 만든 E 컬럼에서 two와 four 가 있는지 조건을 걸고 싶을땐 isin 명령을 쓰면 된다.

In [111]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03 -0.817083 -0.479581 -0.560688  1.953939   two
2013-01-05 -0.317395 -0.103955 -0.643168  0.705956  four

그 결과는 True/False로 반환되는데, 이것을 이용하면 조건에 맞는 데이터를 선택할 수 있다.

In [112]:
df

                   A         B         C         D
2013-01-01 -0.673948 -0.025956  0.872478  0.598716
2013-01-02  0.060423  0.220752  0.638659 -0.519815
2013-01-03 -0.817083 -0.479581 -0.560688  1.953939
2013-01-04 -0.518583 -1.161599 -0.249712  0.134959
2013-01-05 -0.317395 -0.103955 -0.643168  0.705956
2013-01-06  0.869004  0.798328 -1.194615  0.674388

df 변수에서 좀 더 통계 느낌의 데이터를 볼 때는 특정 함수를 적용시키면 좋다. 이때 사용하는 것이 apply 명령이다. 누적합을 알고 싶을 때는 numpy의 cumsum을 이용하면 된다.

In [113]:
df.apply(np.cumsum)

                   A         B         C         D
2013-01-01 -0.673948 -0.025956  0.872478  0.598716
2013-01-02 -0.613525  0.194796  1.511138  0.078901
2013-01-03 -1.430608 -0.284785  0.950450  2.032840
2013-01-04 -1.949191 -1.446384  0.700738  2.167799
2013-01-05 -2.266587 -1.550340  0.057570  2.873756
2013-01-06 -1.397582 -0.752011 -1.137046  3.548143

특별히 최대값과 최소값의 차이를 알고 싶다면 one-line 함수인 lambda를 이용할 수 도 있다.

In [114]:
df.apply(lambda x: x.max() - x.min())

A    1.686087
B    1.959928
C    2.067094
D    2.473754
dtype: float64